app/controllers/users_controller.rb

	def create
		@user = User.new(params[:user])
		if @user.save
---
INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "remember_token", "email") VALUES('jurgen Bosmans', '98248ef58ee35b94196ed94af683c9a58a25a5726af876ae52995bb34752bdb0', '854208d49d17dd150254aba5ed4ef3d7ac44e7ee317318c029dc76a6851c8bcc', '2010-04-23 12:30:17', '2010-04-23 12:30:17', NULL, 'jurgen@2004.be')